GREETING = "Привет!\nЯ представляю собой программу для поиска вакансий на платформах HeadHunter и SuperJob."
ENTER_QUERY = "Пожалуйста, введите ваш поисковый запрос: "
ENTER_PLATFORM = "Выберите платформу (HH - HeadHunter, SJ - SuperJob, Enter - все платформы): "
PRINT_CHOICE = """
        Выберите действие:
        1. Посмотреть весь список вакансий.
        2. Просмотреть информацию о вакансии.
        3. Фильтр по зарплате.
        4. Поиск по ключевому слову в описании.
        5. Удалить вакансию.
        6. Выход.
        """
INPUT_CHOICE = "Введите номер действия: "
PRINT_VACANCIES = "{}. Вакансия: {}, Зарплата: {}"
ENTER_NUMBER_VACANCY = "Введите номер вакансии для отображения информации по ней: "
PRINT_VACANCY = "{}: {}"
NOT_VACANCY_NUMBER = "Вакансия с номером {} не найдена."
ENTER_SALARY = "Введите минимальную желаемую зарплату (или оставьте пустым, чтобы не фильтровать): "
ENTER_KEYWORD = "Введите ключевое слово для поиска в описании (или оставьте пустым, чтобы не фильтровать): "
NOT_VACANCY_KEYWORD = "По вашим критериям не найдено ни одной вакансии."
ENTER_DELETE_VACANCY = "Введите номер вакансии для удаления (или нажмите Enter, чтобы продолжить): "
CONFIRMATION_DELETE_VACANCY = "Вакансия с номером {} удалена."
ERROR_DELETE_VACANCY = "Не удалось удалить вакансию с номером {}. Возможно, она уже была удалена."
GOODBYE_MESSAGE = "Всего доброго!"
